{
    "header": {
        "navbar": {
            "portfolio": "Portfolio",
            "blog": "Blog",
            "about": "About me"
        }
    },
    "about_me": {
        "first_paragraph": "Hello! My name is Jakub Rejch, and I'm a programming enthusiast specializing in frontend and full-stack development. I have been working in the IT industry for four years, currently holding the position of Senior Lead Developer. My journey into coding began with intensive self-study – I dedicated 8-10 hours a day for 11 months to hone my skills.",
        "second_paragraph": "Over the years, I have gained experience in various roles, from Junior React Developer to Software Engineer, and now as a Senior Lead Developer. I am particularly proud of my contributions to the company I work for, including creating and managing a new website and being almost entirely responsible for the frontend development. Implementing translation systems and creating CI/CD pipelines to accelerate deployment are among my key achievements.",
        "third_paragraph": "My core skills include React, JavaScript and Docker, with additional knowledge in Python, Django, MySQL, and PHP. Programming is not just a job for me but a true passion. I'm fascinated by the ability to transform letters and numbers into functional applications that deliver real products and experiences to users.",
        "fourth_paragraph": "Outside of work, I enjoy fly fishing and playing squash. I believe that diligence, responsibility, and honesty are the most important values in the workplace. Technical knowledge is essential, but the ability to use it effectively and responsibly is crucial. I emphasize transparency in teamwork and openly communicating any issues or obstacles.",
        "fifth_paragraph": "In the future, I aim to deepen my knowledge of production-level application containerization and experience working in an office environment to fully understand what it's like to be part of a dynamic team on a daily basis.",
        "sixth_paragraph": "I look forward to connecting and collaborating!",
        "seventh_paragraph": "Jakub Rejch"
    },
    "footer": {
        "contact": "Contact",
        "popup_title": "Contact me",
        "placeholder_name": "Your name",
        "placeholder_email": "Your email",
        "placeholder_message": "Your message",
        "button_send": "Send"
    }
}