{
    "header": {
        "navbar": {
            "portfolio": "Portfolio",
            "blog": "Blog",
            "about": "About me",
            "admin": "Admin"
        }
    },
    "about_me": {
        "first_paragraph": "My name is Jakub Rejch, and I am an experienced Senior Lead Developer specializing in frontend and full-stack development. For over four years, I have been building modern web applications, combining my passion for coding with a strong focus on code quality and process optimization.",
        "second_paragraph": "My journey into programming started with an intense period of self-learning—I dedicated 8–10 hours a day for 11 months to mastering my skills. This commitment allowed me to progress rapidly, advancing from Junior React Developer to Software Engineer, and ultimately to my current role.",
        "third_paragraph": "Throughout my career, I have had the opportunity to work on complex projects where I played a crucial role in development and optimization. I was responsible for designing and building a new company website, taking full ownership of both the frontend and application architecture. Additionally, I implemented a translation system to enhance multilingual support and designed an optimized CI/CD pipeline, enabling faster and more secure deployments.",
        "fourth_paragraph": "My expertise spans a wide range of technologies. On the frontend, I work primarily with React, JavaScript, and TypeScript. For backend development, I have experience with Python, Django, and PHP, and I am proficient in working with MySQL databases. In the DevOps domain, I focus on Docker and CI/CD automation, ensuring smooth deployment processes and efficient infrastructure management.",
        "fifth_paragraph": "Outside of programming, I am passionate about fly fishing and squash. Looking ahead, I am eager to deepen my knowledge of containerization at a production level and gain experience in an in-office environment to fully immerse myself in a dynamic team setting.",
        "sixth_paragraph": "I'm always open to new challenges and collaborations—feel free to reach out!",
        "seventh_paragraph": "Jakub Rejch"
    },
    "footer": {
        "contact": "Contact",
        "popup_title": "Contact me",
        "placeholder_name": "Your name",
        "placeholder_email": "Your email",
        "placeholder_message": "Your message",
        "button_send": "Send"
    },
    "admin": {
        "add_skill_button": "Add Skill"
    }
}