{
    "header": {
        "navbar": {
            "portfolio": "Portfolio",
            "blog": "Blog",
            "about": "O mnie",
            "admin": "Admin"
        }
    },
    "about_me": {
        "first_paragraph": "Nazywam się Jakub Rejch i jestem doświadczonym Developerem ze specjalizacją w frontendzie oraz fullstack development. Od ponad pięciu lat tworzę nowoczesne aplikacje webowe, łącząc pasję do programowania z dbałością o jakość kodu i optymalizację procesów.",
        "second_paragraph": "Moja przygoda z programowaniem rozpoczęła się od intensywnej, samodzielnej nauki – przez 11 miesięcy poświęcałem codziennie 8–10 godzin na rozwój swoich umiejętności. Ta determinacja pozwoliła mi szybko zdobyć doświadczenie i awansować od Junior React Developera, przez Software Engineera, aż po Senior Lead Developera.",
        "third_paragraph": "Przez lata miałem okazję pracować nad kompleksowymi projektami, w których pełniłem kluczową rolę w rozwoju i optymalizacji aplikacji. Byłem odpowiedzialny za budowę i rozwój nowej strony internetowej, obejmującą zarówno frontend, jak i architekturę aplikacji. Wdrożyłem system tłumaczeń, który usprawnił obsługę wielojęzyczności, a także zaprojektowałem i zoptymalizowałem procesy CI/CD, co pozwoliło na szybsze i bezpieczniejsze wdrożenia. Moje główne kompetencje obejmują technologie frontendowe, takie jak React, JavaScript i TypeScript, a także backendowe rozwiązania oparte na Pythonie, Django i PHP. Posiadam również doświadczenie w pracy z bazami danych MySQL oraz w obszarze DevOps, w tym konteneryzacją przy użyciu Dockera i automatyzacją wdrożeń w ramach CI/CD. Programowanie to dla mnie więcej niż zawód – to pasja, która pozwala mi tworzyć rozwiązania realnie wpływające na użytkowników. Wierzę, że technologia to nie tylko kod, ale przede wszystkim odpowiedzialność, transparentność i skuteczność w działaniu.",
        "fourth_paragraph": "Prywatnie pasjonuję się wędkarstwem muchowym oraz squashem. W przyszłości chciałbym jeszcze bardziej zgłębić temat konteneryzacji aplikacji na poziomie produkcyjnym oraz doświadczyć pracy w dynamicznym środowisku biurowym.",
        "fifth_paragraph": "W przyszłości chciałbym pogłębić swoją wiedzę na temat konteneryzacji aplikacji na poziomie produkcyjnym oraz doświadczyć pracy w biurze, aby móc na własnej skórze poczuć, jak to jest być częścią dynamicznego zespołu na co dzień.",
        "sixth_paragraph": "Zapraszam do kontaktu i współpracy!",
        "seventh_paragraph": "Jakub Rejch"
    },
    "footer": {
        "contact": "Kontakt",
        "popup_title": "Skontaktuj się ze mną",
        "placeholder_name": "Twoje imię",
        "placeholder_email": "Twój adres e-mail",
        "placeholder_message": "Twoja wiadomość",
        "button_send": "Wyślij"
    },
    "admin": {
        "add_skill_button": "Dodaj umiejętność"
    }
}